import { Metadata } from "next";

export const metadata: Metadata = {
  title: "About - hodleveryday.com",
  description: "hodleveryday.com เป็นชุมชนที่กระตือรือร้นที่อุทิศให้กับโลกแห่งสกุลเงินดิจิทัลและเทคโนโลยีบล็อกเชน",
};

export default function AboutPage() {
  return (
    <div className="flex w-full h-full justify-center items-center flex-col text-[1rem] md:text-[1.2rem] font-sans text-[#393939] p-4 md:p-0 font-light">
      <div className="w-full md:w-[50%] lg:w-[40%] break-words mt-[75px]">
        <h1 className="text-3xl text-center font-bold">About</h1>
        <p>
          hodleveryday.com
          เป็นชุมชนที่กระตือรือร้นที่อุทิศให้กับโลกแห่งสกุลเงินดิจิทัลและเทคโนโลยีบล็อกเชน
          <br></br>
          <br></br>
          เรามุ่งมั่นที่จะมอบ: เนื้อหาที่ให้ข้อมูลและมีส่วนร่วม
          <br></br>
          <br></br>
          เรานำเสนอแหล่งข้อมูลทางการศึกษา การอัปเดตข่าวสาร
          และการวิเคราะห์ตลาดที่หลากหลาย
          ทั้งหมดนี้ออกแบบมาเพื่อช่วยให้ผู้ใช้รับทราบข้อมูลเกี่ยวกับภูมิทัศน์ของสกุลเงินดิจิทัลที่พัฒนาอยู่ตลอดเวลา
          แพลตฟอร์มสำหรับการอภิปรายและการเรียนรู้
          <br></br>
          <br></br>
          เราสนับสนุนให้มีการอภิปรายแบบเปิดและแบ่งปันความรู้ภายในชุมชนของเรา
          ไม่ว่าคุณจะเป็นนักลงทุน crypto ที่มีประสบการณ์หรือเพิ่งเริ่มต้น
          hodleveryday.com
          เป็นที่สำหรับเชื่อมต่อกับผู้อื่นที่มีความสนใจเหมือนกับคุณ
          สภาพแวดล้อมที่สนับสนุนและครอบคลุม
          <br></br>
          <br></br>
          เราเชื่อว่าทุกคนควรมีโอกาสเรียนรู้และมีส่วนร่วมในการปฏิวัติสกุลเงินดิจิทัล
          เรายินดีต้อนรับผู้คนทุกระดับและทุกระดับประสบการณ์เพื่อเข้าร่วมชุมชนของเรา
          <br></br>
          <br></br>
          ภารกิจของเรา
          ภารกิจของเราคือการเสริมศักยภาพบุคคลด้วยความรู้และทรัพยากรที่จำเป็นในการตัดสินใจอย่างรอบรู้เกี่ยวกับการลงทุนสกุลเงินดิจิทัลของตน
          เราเชื่อว่าการศึกษาเป็นกุญแจสำคัญในการสร้างอนาคตที่แข็งแกร่งและยั่งยืนสำหรับอุตสาหกรรมสกุลเงินดิจิทัล
          <br></br>
          <br></br>
          ทีมงานของเรา hodleveryday.com
          ดำเนินการโดยทีมงานที่มีความกระตือรือร้นและมีประสบการณ์มากมายในด้านสกุลเงินดิจิทัลและบล็อกเชน
          เราทุกคนทุ่มเทเพื่อให้ผู้ใช้ของเราได้รับประสบการณ์ที่ดีที่สุดเท่าที่จะเป็นไปได้
          และช่วยให้พวกเขาบรรลุเป้าหมายทางการเงิน เข้าร่วมชุมชน
          เราขอเชิญชวนให้คุณสำรวจเว็บไซต์ของเรา เข้าร่วมการสนทนาของเรา
          และเป็นส่วนหนึ่งของชุมชน hodleveryday.com เมื่อร่วมมือกัน
          เราสามารถเรียนรู้ เติบโต
          และประสบความสำเร็จในโลกที่น่าตื่นเต้นของสกุลเงินดิจิทัล
        </p>
      </div>
      <div className="h-[35px]">
      </div>
    </div>
  );
}
