import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Privacy Policy - hodleveryday.com",
  description: "Privacy Policy hodleveryday.com เคารพความเป็นส่วนตัวของผู้ใช้ของเรา นโยบายความเป็นส่วนตัวนี้อธิบายถึงประเภทของข้อมูลที่เรารวบรวม วิธีการใช้งาน และตัวเลือกที่คุณเชื่อมโยงกับข้อมูลของคุณ",
  robots: {
    index: false,
    follow: true,
  },
};

export default function PrivacyPolicy() {
  return (
    <div className="flex w-full h-full justify-center items-center flex-col text-[1rem] md:text-[1.2rem] font-sans text-[#393939] p-4 md:p-0 font-light">
      <div className="w-full md:w-[50%] lg:w-[40%] break-words mt-[75px]">
        <h1 className="text-3xl text-center font-bold">Privacy Policy</h1>
        <div className="flex justify-start mt-[2rem]">
          <strong>วันที่มีผลบังคับใช้:</strong>
          <span>3 มีนาคม 2024</span>
        </div>
        <br></br>
        <p>
          hodleveryday.com ("hodleveryday", "เรา", "พวกเรา" หรือ "ของเรา")
          เคารพความเป็นส่วนตัวของผู้ใช้ของเรา ("คุณ" หรือ "ของคุณ")
          นโยบายความเป็นส่วนตัวนี้อธิบายถึงประเภทของข้อมูลที่เรารวบรวม
          วิธีการใช้งาน และตัวเลือกที่คุณเชื่อมโยงกับข้อมูลของคุณ
        </p>
        <br></br>
        <p>
          ข้อมูลส่วนบุคคล: เมื่อคุณสร้างบัญชีหรือติดต่อเรา
          คุณอาจให้ข้อมูลส่วนบุคคลบางอย่างแก่เรา เช่น ชื่อ ที่อยู่อีเมล
          หมายเลขโทรศัพท์ และชื่อผู้ใช้ของคุณ ข้อมูลการใช้งาน:
          เรารวบรวมข้อมูลเกี่ยวกับการใช้งานเว็บไซต์ของเรา เช่น
          หน้าที่คุณเยี่ยมชม ลิงก์ที่คุณคลิก และการค้นหาที่คุณดำเนินการ
          ข้อมูลอุปกรณ์:
          เรารวบรวมข้อมูลเกี่ยวกับอุปกรณ์ที่คุณใช้ในการเข้าถึงเว็บไซต์ของเรา
          เช่น ประเภทอุปกรณ์ ระบบปฏิบัติการ ที่อยู่ IP และประเภทเบราว์เซอร์
          เราใช้ข้อมูลของคุณอย่างไร
        </p>
        <br></br>
        <p>
          เราใช้ข้อมูลของคุณเพื่อ: ให้บริการและปรับปรุงเว็บไซต์และบริการของเรา
          ส่งข้อมูลเกี่ยวกับผลิตภัณฑ์และบริการของเรา รวมถึงข้อเสนอส่งเสริมการขาย
          ตอบคำถามและคำขอของคุณ
          ป้องกันและตรวจจับการฉ้อโกงและกิจกรรมที่ผิดกฎหมายอื่น ๆ
          การแบ่งปันข้อมูลของคุณ
        </p>
        <br></br>
        <p>
          เราอาจแบ่งปันข้อมูลของคุณกับผู้ขายบุคคลที่สามที่ให้บริการแก่เรา เช่น
          การจัดเก็บข้อมูล การตลาด และการสนับสนุนลูกค้า
          ผู้ขายเหล่านี้มีหน้าที่ปกป้องข้อมูลของคุณและใช้เพื่อวัตถุประสงค์ที่เราระบุไว้เท่านั้น
        </p>
        <br></br>
        <p>
          เรายังอาจเปิดเผยข้อมูลของคุณหากจำเป็นต้องทำเช่นนั้นตามกฎหมายหรือด้วยความเชื่อโดยสุจริตว่าการเปิดเผยดังกล่าวมีความจำเป็นเพื่อปฏิบัติตามภาระผูกพันทางกฎหมาย
          ปกป้องสิทธิ์ของ hodleveryday.com
          หรือปกป้องความปลอดภัยหรือความมั่นคงของผู้อื่น
        </p>
        <br></br>
        <br></br>
        <h2>
          <strong>ทางเลือกของคุณ</strong>
        </h2>
        <p>
          คุณมีตัวเลือกต่อไปนี้เกี่ยวกับข้อมูลของคุณ:
          คุณสามารถเข้าถึงและอัปเดตข้อมูลส่วนบุคคลของคุณผ่านการตั้งค่าบัญชีของคุณ
          คุณสามารถยกเลิกการสมัครรับอีเมลการตลาดของเราได้โดยการคลิกลิงก์ยกเลิกการสมัครในอีเมลใดๆ
          ที่คุณได้รับจากเรา คุณสามารถเลือกที่จะปฏิเสธคุกกี้ได้
          (ดูข้อมูลเพิ่มเติมด้านล่าง) คุ้กกี้
        </p>
        <br></br>
        <p>
          เราใช้คุกกี้เพื่อจัดเก็บข้อมูลเกี่ยวกับการตั้งค่าและกิจกรรมของคุณบนเว็บไซต์ของเรา
          คุณสามารถเลือกที่จะปิดการใช้งานคุกกี้ได้ในการตั้งค่าเบราว์เซอร์ของคุณ
          แต่อาจจำกัดความสามารถของคุณในการใช้คุณสมบัติบางอย่างของเว็บไซต์ของเรา
        </p>
        <br></br>
        <br></br>
        <h2><strong>ความปลอดภัยของข้อมูล</strong></h2>
        <p>
          เราดำเนินการตามขั้นตอนที่เหมาะสมเพื่อปกป้องข้อมูลของคุณจากการเข้าถึง
          การเปิดเผย การเปลี่ยนแปลง หรือการทำลายโดยไม่ได้รับอนุญาต อย่างไรก็ตาม
          ไม่มีการส่งผ่านเว็บไซต์หรืออินเทอร์เน็ตใดที่ปลอดภัยอย่างสมบูรณ์
          และเราไม่สามารถรับประกันความปลอดภัยของข้อมูลของคุณได้
        </p>
        <br></br>
        <br></br>
        <h2>
          <strong>การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้</strong>
        </h2>
        <p>
          เราอาจปรับปรุงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว
          เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใด ๆ
          โดยการโพสต์นโยบายความเป็นส่วนตัวใหม่บนเว็บไซต์ของเรา
        </p>
        <br></br>
        <br></br>
        <h2>
          <strong>ติดต่อเรา</strong>
        </h2>
        <p>
          หากคุณมีคำถามใด ๆ เกี่ยวกับนโยบายความเป็นส่วนตัวนี้
          โปรดติดต่อเราที่ tanaponarmy1998@gmail.com
        </p>
      </div>
    </div>
  );
}
